Revit 2027 API
StructuralAsset.SetYoungModulus Method
 Sets the Young's modulus of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetYoungModulus(
	double youngModulus
)
Public Sub SetYoungModulus (
	youngModulus As Double
)
public:
void SetYoungModulus(
	double youngModulus
)
member SetYoungModulus :
        youngModulus : float -> unit
Parameters
youngModulus Double
Remarks
 The Young's modulus is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value. The value is in Newtons per foot meter (N/(ft · m)).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace